===============================================================================
Single line comment (empty)
===============================================================================

--

---

(source_file
  (single_line_comment))

===============================================================================
Single line comment (non-empty)
===============================================================================

-- ABC

---

(source_file
  (single_line_comment))

===============================================================================
Single line comment (at end of line)
===============================================================================

SELECT --
null;

---

(source_file
  (select_statement
    (SELECT)
    (single_line_comment)
    (select_list
      (select_result
        (null_literal)))))

===============================================================================
Multi line comment (empty)
===============================================================================

/**/

---

(source_file
  (multi_line_comment))

===============================================================================
Multi line comment (non-empty)
===============================================================================

/*abc*/

---

(source_file
  (multi_line_comment))

===============================================================================
Multi line comment (with newline)
===============================================================================

/*
*/

---

(source_file
  (multi_line_comment))

===============================================================================
Multi line comment (inside statement)
===============================================================================

SELECT /**/ null;

---

(source_file
  (select_statement
    (SELECT)
    (multi_line_comment)
    (select_list
      (select_result
        (null_literal)))))
