===============================================================================
NULL
===============================================================================

NULL

---

(source_file
  (projection
    (result_expr
      (null_literal))))


===============================================================================
NULL lowercase
===============================================================================

null

---

(source_file
  (projection
    (result_expr
      (null_literal))))

===============================================================================
MISSING
===============================================================================

MISSING

---

(source_file
  (projection
    (result_expr
      (missing_literal))))


===============================================================================
MISSING lowercase
===============================================================================

missing

---

(source_file
  (projection
    (result_expr
      (missing_literal))))

===============================================================================
TRUE
===============================================================================

TRUE

---

(source_file
  (projection
    (result_expr
      (true_literal))))


===============================================================================
TRUE lowercase
===============================================================================

true

---

(source_file
  (projection
    (result_expr
      (true_literal))))

===============================================================================
FALSE
===============================================================================

FALSE

---

(source_file
  (projection
    (result_expr
      (false_literal))))


===============================================================================
FALSE lowercase
===============================================================================

false

---

(source_file
  (projection
    (result_expr
      (false_literal))))

===============================================================================
Integer
===============================================================================

123

---

(source_file
  (projection
    (result_expr
      (number_literal))))

===============================================================================
Integer with minus
===============================================================================

-123

---

(source_file
  (projection
    (result_expr
      (number_literal))))

===============================================================================
Float
===============================================================================

1.23

---

(source_file
  (projection
    (result_expr
      (number_literal))))

===============================================================================
Float with minus
===============================================================================

-1.23

---

(source_file
  (projection
    (result_expr
      (number_literal))))

===============================================================================
Float with exponent
===============================================================================

1.2e3

---

(source_file
  (projection
    (result_expr
      (number_literal))))

===============================================================================
Float without decimal with exponent
===============================================================================

1e23

---

(source_file
  (projection
    (result_expr
      (number_literal))))

===============================================================================
String with single quotes (empty)
===============================================================================

''

---

(source_file
  (projection
    (result_expr
      (string_literal))))

===============================================================================
String with single quotes
===============================================================================

'abc'

---

(source_file
  (projection
    (result_expr
      (string_literal))))

===============================================================================
String with escaped single quotes
===============================================================================

'a\'bc'

---

(source_file
  (projection
    (result_expr
      (string_literal))))

===============================================================================
String with double quotes (empty)
===============================================================================

""

---

(source_file
  (projection
    (result_expr
      (string_literal))))

===============================================================================
String with double quotes
===============================================================================

"abc"

---

(source_file
  (projection
    (result_expr
      (string_literal))))

===============================================================================
String with escaped double quotes
===============================================================================

"a\"bc"

---

(source_file
  (projection
    (result_expr
      (string_literal))))
