===============================================================================
NULL
===============================================================================

NULL

---

(source_file
  (select_list
    (select_result
      (NULL))))


===============================================================================
NULL lowercase
===============================================================================

null

---

(source_file
  (select_list
    (select_result
      (NULL))))

===============================================================================
MISSING
===============================================================================

MISSING

---

(source_file
  (select_list
    (select_result
      (MISSING))))


===============================================================================
MISSING lowercase
===============================================================================

missing

---

(source_file
  (select_list
    (select_result
      (MISSING))))

===============================================================================
TRUE
===============================================================================

TRUE

---

(source_file
  (select_list
    (select_result
     (TRUE))))


===============================================================================
TRUE lowercase
===============================================================================

true

---

(source_file
  (select_list
    (select_result
      (TRUE))))

===============================================================================
FALSE
===============================================================================

FALSE

---

(source_file
  (select_list
    (select_result
      (FALSE))))


===============================================================================
FALSE lowercase
===============================================================================

false

---

(source_file
  (select_list
    (select_result
      (FALSE))))

===============================================================================
Integer
===============================================================================

123

---

(source_file
  (select_list
    (select_result
      (int_literal))))

===============================================================================
Integer with minus
===============================================================================

-123

---

(source_file
  (select_list
    (select_result
      (int_literal))))

===============================================================================
Integer with leading zero
===============================================================================

0123

---

(source_file
  (select_list
    (select_result
      (int_literal))))

===============================================================================
Float
===============================================================================

1.23

---

(source_file
  (select_list
    (select_result
      (float_literal))))

===============================================================================
Float with out integer part
===============================================================================

.123

---

(source_file
  (select_list
    (select_result
      (float_literal))))

===============================================================================
Float with minus
===============================================================================

-1.23

---

(source_file
  (select_list
    (select_result
      (float_literal))))

===============================================================================
Float with out integer part with minus
===============================================================================

-.123

---

(source_file
  (select_list
    (select_result
      (float_literal))))

===============================================================================
Float with exponent
===============================================================================

1.2e3

---

(source_file
  (select_list
    (select_result
      (float_literal))))

===============================================================================
Float without decimal with exponent
===============================================================================

1e23

---

(source_file
  (select_list
    (select_result
      (float_literal))))

===============================================================================
String with single quotes (empty)
===============================================================================

''

---

(source_file
  (select_list
    (select_result
      (string_literal))))

===============================================================================
String with single quotes
===============================================================================

'abc'

---

(source_file
  (select_list
    (select_result
      (string_literal))))

===============================================================================
String with escaped single quotes
===============================================================================

'a''bc'

---

(source_file
  (select_list
    (select_result
      (string_literal))))

===============================================================================
String with double quotes (empty)
===============================================================================

""

---

(source_file
  (select_list
    (select_result
      (string_literal))))

===============================================================================
String with double quotes
===============================================================================

"abc"

---

(source_file
  (select_list
    (select_result
      (string_literal))))

===============================================================================
String with escaped double quotes
===============================================================================

"a""bc"

---

(source_file
  (select_list
    (select_result
      (string_literal))))
