===
SELECT null;
===

SELECT null;

---

(source_file
  (select_statement
    (select_expr
      select: (select_clause
        (SELECT)
        projection: (projection
          (result_expr
            expr: (null_literal)))))))

===
SELECT null AS a;
===

SELECT null AS a;

---

(source_file
  (select_statement
    (select_expr
      select: (select_clause
        (SELECT)
        projection: (projection
          (result_expr
            expr: (null_literal)
            (AS)
            alias: (identifier)))))))

===
SELECT null a;
===

SELECT null a;

---

(source_file
  (select_statement
    (select_expr
      select: (select_clause
        (SELECT)
        projection: (projection
          (result_expr
            expr: (null_literal)
            alias: (identifier)))))))

===
SELECT *, a.*, a AS b;
===

SELECT *, a.*, a AS b;

---

(source_file
  (select_statement
    (select_expr
      select: (select_clause
        (SELECT)
        projection: (projection
          (star_expr)
          (star_expr
            path: (select_path_segment
              identifier: (identifier)))
          (result_expr
            expr: (identifier)
            (AS)
            alias: (identifier)))))))
